### PANDAS ADVANCE 1 Assignment

#### Q1. List any five functions of the pandas library with execution.

1. read_csv() - read_csv() function helps read a comma-separated values (csv) file into a Pandas DataFrame.
2. head() - head(n) is used to return the first n rows of a dataset. By default, df.head() will return the first 5 rows of the DataFrame. 
3. describe() - describe() is used to generate descriptive statistics of the data in a Pandas DataFrame or Series. It summarizes central tendency and dispersion of the dataset. describe() helps in getting a quick overview of the dataset.
4. groupby() - groupby() is used to group a Pandas DataFrame by 1 or more columns, and perform some mathematical operation on it. groupby() can be used to summarize data in a simple manner.
5. sort_values() - sort_values() is used to sort column in a Pandas DataFrame (or a Pandas Series) by values in ascending or descending order.

#### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [5]:
import pandas as pd

df = pd.DataFrame({'A' :[1,2,3,4] , 'B' :[5,6,7,8,] , 'C' : [9,10,11,12]})

In [6]:
df

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [10]:
df_reindexed = df.reindex([1, 3, 5,7])

In [11]:
print(df_reindexed)

     A    B     C
1  2.0  6.0  10.0
3  4.0  8.0  12.0
5  NaN  NaN   NaN
7  NaN  NaN   NaN

#### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [19]:
import numpy as np
import pandas as pd

df1 = {'Values' : [10, 20, 30, 40, 50]}

In [29]:
df2 = pd.DataFrame(df1)
df2

   Values
0      10
1      20
2      30
3      40
4      50

In [35]:
sum = df2.loc[[0, 1, 2]].sum() 
sum

Values    60
dtype: int64

#### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [39]:
df3 = {'Text' : ["Data science story which is not possible to copy paste for me" , "My name is Nisha , and i am learning ds master class"]}

df4=pd.DataFrame(df3)
df4

In [44]:
df4['Word_count'] = df4['Text'].apply(len)
df4

                                                Text  Word_count
0  Data science story which is not possible to co...          61
1  My name is Nisha , and i am learning ds master...          52

#### Q5. How are DataFrame.size() and DataFrame.shape() different?

#### Pandas DataFrame size()
The size property is used to get an int representing the number of elements in this object and Return the number of rows if Series. Otherwise, return the number of rows times the number of columns if DataFrame.

In [47]:
import pandas as pd
  
# making data frame
data = pd.read_csv('train.csv')
size = data.size
print("Size = {}".format(size))

Size = 10692

#### Pandas DataFrame shape()
The shape property is used to get a tuple representing the dimensionality of the Pandas DataFrame.

In [48]:
import pandas as pd
  
# making data frame
data = pd.read_csv('train.csv')
  
# dataframe.shape
shape = data.shape
  
  
# printing shape
print("Shape = {}".format(shape))

Shape = (891, 12)

#### Q6. Which function of pandas do we use to read an excel file?

Ans - pd.read_excel

#### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

In [49]:
df10 = {'Email' : ['nisha@gmail.com' , 'aish@yahoo.com' , 'shah@gmail.com']}
df10

{'Email': ['nisha@gmail.com', 'aish@yahoo.com', 'shah@gmail.com']}

In [51]:
df11 = pd.DataFrame(df10)
df11

             Email
0  nisha@gmail.com
1   aish@yahoo.com
2   shah@gmail.com

In [54]:
df11['Username'] = df11['Email'].apply(lambda x: x.split('@')[0])
df11

             Email Username
0  nisha@gmail.com    nisha
1   aish@yahoo.com     aish
2   shah@gmail.com     shah

#### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [55]:
df0 = {'A' : [3,8,6,2,9] , 'B' : [5,2,9,3,1] , 'C' : [1,7,4,5,2]}
df0

{'A': [3, 8, 6, 2, 9], 'B': [5, 2, 9, 3, 1], 'C': [1, 7, 4, 5, 2]}

In [57]:
df01 = pd.DataFrame(df0)
df01

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [60]:
ans = pd.DataFrame(df0)
newdf = (ans[(ans['A'] > 5) & (ans['B'] < 10)])
newdf

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

#### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,median,and standard deviation of the values in the 'Values' column.

In [64]:
dfnew = {'Values' :[4,5,6,7]}
dfnew1 = pd.DataFrame(dfnew)
dfnew1

   Values
0       4
1       5
2       6
3       7

In [65]:
dfnew1['Values'].mean()

5.5

In [66]:
dfnew1['Values'].median()

5.5

In [67]:
dfnew1['Values'].std()

1.2909944487358056

#### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [78]:
dfnew2 = {'Sales' : [20 , 30 , 15 , 40 , 10 , 35 , 10] ,
          'Date' :['2023-01-01' , '2023-01-02' , '2023-01-03' , '2023-01-04' ,'2023-01-05' , '2023-01-06' , '2023-01-07'] }
dfnew3 = pd.DataFrame(dfnew2)
dfnew3

   Sales        Date
0     20  2023-01-01
1     30  2023-01-02
2     15  2023-01-03
3     40  2023-01-04
4     10  2023-01-05
5     35  2023-01-06
6     10  2023-01-07

In [81]:
#avg = sum('Sales')/len('Sales')
dfnew3['MovingAverage'] = dfnew3['Sales'].rolling(7).mean()

In [82]:
dfnew3

   Sales        Date  MovingAverage
0     20  2023-01-01            NaN
1     30  2023-01-02            NaN
2     15  2023-01-03            NaN
3     40  2023-01-04            NaN
4     10  2023-01-05            NaN
5     35  2023-01-06            NaN
6     10  2023-01-07      22.857143

#### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.Monday, Tuesday) corresponding to each date in the 'Date' column. For example, if df contains the following values:

In [91]:
dfnew4 = {'Date' : ['2023-01-01' , '2023-01-02' , '2023-01-03' , '2023-01-04' ,'2023-01-05']}
dfnew4['Date'] = pd.to_datetime(dfnew4['Date'])
dfnew4 = pd.DataFrame(dfnew4)
dfnew4

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [92]:
dfnew4['Weekday'] = dfnew4['Date'].dt.day_name()
dfnew4

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

#### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

#### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

In [97]:
import pandas as pd